app/controllers/api/v1/creators_controller.rb

SELECT  "creators".* FROM "creators" LIMIT 10 OFFSET 0
---
  def index
    respond_with Creator.limit(@limit).offset(@offset)

SELECT  "creators".* FROM "creators" WHERE "creators"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Creator.find(params[:id])