app/controllers/api/v1/positions_controller.rb

  def index
    respond_with Position.limit(@limit).offset(@offset)
---
SELECT  "positions".* FROM "positions" LIMIT 10 OFFSET 0

  def show
    respond_with Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 1]]