app/controllers/api/v1/pubs_controller.rb

  def index
    if params[:tag_id]
      # Get pubs connected to a tag
      tag = Tag.find_by_id(params[:tag_id])
      pubs = tag.pubs.limit(@limit).offset(@offset) if tag.present?
    elsif params[:creator_id]
      # Get pubs connected to a creator
      creator = Creator.find_by_id(params[:creator_id])
      pubs = creator.pubs.limit(@limit).offset(@offset) if creator.present?
    elsif params[:email]
      creator = Creator.find_by_email(params[:email]);
      pubs = creator.pubs.limit(@limit).offset(@offset) if creator.present?
    elsif params[:near_address]
      # Get pubs near position (address)
      pubs = get_pubs_near_positions(params[:near_address])
    elsif params[:lng] && params[:ltd]
      # Get pubs near position (latitude and longitude)
      pubs = get_pubs_near_positions([params[:ltd], params[:lng]])
    else
      pubs = Pub.all.limit(@limit).offset(@offset)
    end

    if pubs.present?
      # starts_with query can be present
      pubs = pubs.starts_with(params[:starts_with]) if params[:starts_with]
      response = { offset: @offset, limit: @limit, count: pubs.count, pubs: ActiveModel::ArraySerializer.new(pubs) }
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "pubs".* FROM "pubs" INNER JOIN "pubs_tags" ON "pubs"."id" = "pubs_tags"."pub_id" WHERE "pubs_tags"."tag_id" = ? AND (name like 'asd%') LIMIT 10 OFFSET 0  [["tag_id", 1]]
SELECT  "creators".* FROM "creators" WHERE "creators"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."creator_id" = ? LIMIT 10 OFFSET 0  [["creator_id", 1]]
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."position_id" = ? LIMIT 1  [["position_id", 5]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "pubs" INNER JOIN "pubs_tags" ON "pubs"."id" = "pubs_tags"."pub_id" WHERE "pubs_tags"."tag_id" = ? AND (name like 'asd%') LIMIT 10 OFFSET 0) subquery_for_count  [["tag_id", 1]]

  def show
    pub = Pub.find_by_id(params[:id])
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = ? LIMIT 1  [["id", 2]]

  def create
    begin
      return unless position_param_present? && position_is_available?

      pub = Pub.new(pub_params.except(:tags, :position))


      if tags = pub_params[:tags]
        tags.each do |tag|
          pub.tags << Tag.where(tag).first_or_create
        end
      end

      if pub.save
---
INSERT INTO "positions" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "Skräddaretorpsvägen 14"], ["latitude", 56.6859614], ["longitude", 16.3350877], ["created_at", "2016-03-13 23:32:46.464648"], ["updated_at", "2016-03-13 23:32:46.464648"]]
INSERT INTO "pubs" ("name", "phone_number", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Olearys"], ["phone_number", "123123123"], ["description", "Hejsan, fin pub hejdå"], ["created_at", "2016-02-23 14:31:19.952901"], ["updated_at", "2016-02-23 14:31:19.952901"]]
INSERT INTO "pubs_tags" ("tag_id", "pub_id") VALUES (?, ?)  [["tag_id", 4], ["pub_id", 26]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mycket bra!"], ["created_at", "2016-03-13 23:40:21.182024"], ["updated_at", "2016-03-13 23:40:21.182024"]]
UPDATE "pubs" SET "creator_id" = ?, "position_id" = ?, "updated_at" = ? WHERE "pubs"."id" = ?  [["creator_id", 1], ["position_id", 6], ["updated_at", "2016-05-11 14:44:17.416103"], ["id", 6]]

  def update
    pub = Pub.find_by_id(params[:id])

    render json: { error: CAND_FIND_PUB }, status: :bad_request and return unless pub
    render json: { error: CANT_EDIT }, status: :unauthorized and return unless current_user == pub.creator

    begin
      if pub.update(pub_params)
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "pubs" SET "name" = ?, "phone_number" = ?, "description" = ?, "updated_at" = ? WHERE "pubs"."id" = ?  [["name", "asdasd Test Pub"], ["phone_number", "070777"], ["description", "HehEhEheh"], ["updated_at", "2016-03-14 00:57:19.224783"], ["id", 1]]

  def destroy
    pub = Pub.find_by_id(params[:id])

    render json: { error: CAND_FIND_PUB }, status: :bad_request and return unless pub
    render json: { error: CANT_DESTROY }, status: :bad_request and return unless current_user == pub.creator

    pub.destroy
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "pubs" WHERE "pubs"."id" = ?  [["id", 5]]