app/controllers/api/v1/tags_controller.rb

SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
---
  def index
    if (params[:pub_id])
      pub = Pub.find_by_id(params[:pub_id])
      respond_with pub.tags
    else
      respond_with Tag.all

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Tag.find_by_id(params[:id])

SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "pubs_tags" ("pub_id", "tag_id") VALUES (?, ?)  [["pub_id", 1], ["tag_id", 4]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Nice!!"], ["created_at", "2016-03-15 21:42:28.252297"], ["updated_at", "2016-03-15 21:42:28.252297"]]
---
  def create
    if params[:pub_id].blank?
      render json: { error: "Need a pub to attach tag to" } and return
    end

    pub = Pub.find_by_id(params[:pub_id])
    render json: { error: "Could not find the pub" } and return unless pub.present?

    pub = Pub.find_by_id(params[:pub_id])

    begin
      tag = Tag.new(tag_params)

      if tag.save