app/controllers/apps_controller.rb

  def create

    @app = App.create(app_params)
    @app.user = current_user

    if @app.save
---
INSERT INTO "apps" ("name", "user_id", "created_at", "updated_at", "api_key") VALUES (?, ?, ?, ?, ?)  [["name", "ASdasdasdasD"], ["user_id", 1], ["created_at", "2016-02-11 15:04:46.346799"], ["updated_at", "2016-02-11 15:04:46.346799"], ["api_key", "25184351f85b5fff6455df642729db51"]]
UPDATE "apps" SET "user_id" = ?, "updated_at" = ? WHERE "apps"."id" = ?  [["user_id", 11], ["updated_at", "2016-02-04 15:39:25.683835"], ["id", 3]]

  def destroy
    App.find(params[:id]).destroy
---
DELETE FROM "apps" WHERE "apps"."id" = ?  [["id", 1]]
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 3]]